; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l15_p15_c15_g15_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 medicine)
	(crate-content crate12 medicine)
	(crate-content crate13 medicine)
	(crate-content crate14 medicine)
	(crate-content crate15 medicine)
	(at person1 loc6)
	(at person2 loc14)
	(at person3 loc13)
	(at person4 loc12)
	(at person5 loc5)
	(at person6 loc8)
	(at person7 loc6)
	(at person8 loc10)
	(at person9 loc7)
	(at person10 loc8)
	(at person11 loc9)
	(at person12 loc12)
	(at person13 loc6)
	(at person14 loc11)
	(at person15 loc4)
	(person-needs person1 food)
	(person-needs person1 medicine)
	(person-needs person2 food)
	(person-needs person3 food)
	(person-needs person4 food)
	(person-needs person4 medicine)
	(person-needs person5 food)
	(person-needs person5 medicine)
	(person-needs person6 food)
	(person-needs person6 medicine)
	(person-needs person7 food)
	(person-needs person7 medicine)
	(person-needs person10 food)
	(person-needs person12 food)
	(person-needs person15 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person1 medicine)
	(person-has person2 food)
	(person-has person3 food)
	(person-has person4 food)
	(person-has person4 medicine)
	(person-has person5 food)
	(person-has person5 medicine)
	(person-has person6 food)
	(person-has person6 medicine)
	(person-has person7 food)
	(person-has person7 medicine)
	(person-has person10 food)
	(person-has person12 food)
	(person-has person15 food)
	))
)

; plan
1. (grab-arm2 drone1 crate15 depot)
   deleted: (arm2-free drone1) (at crate15 depot)
   added: (arm2-load drone1 crate15)
   goals met: 1 of 16
2. (grab-arm1 drone1 crate10 depot)
   deleted: (arm1-free drone1) (at crate10 depot)
   added: (arm1-load drone1 crate10)
   goals met: 1 of 16
3. (move-drone drone1 depot loc14)
   deleted: (at drone1 depot)
   added: (at drone1 loc14)
   goals met: 0 of 16
4. (deliver-arm1 drone1 person2 crate10 food loc14)
   deleted: (arm1-load drone1 crate10) (person-needs person2 food)
   added: (arm1-free drone1) (person-has person2 food)
   goals met: 1 of 16
5. (move-drone drone1 loc14 loc13)
   deleted: (at drone1 loc14)
   added: (at drone1 loc13)
   goals met: 1 of 16
6. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 2 of 16
7. (grab-arm1 drone1 crate9 depot)
   deleted: (arm1-free drone1) (at crate9 depot)
   added: (arm1-load drone1 crate9)
   goals met: 2 of 16
8. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 1 of 16
9. (deliver-arm1 drone1 person3 crate9 food loc13)
   deleted: (arm1-load drone1 crate9) (person-needs person3 food)
   added: (arm1-free drone1) (person-has person3 food)
   goals met: 2 of 16
10. (move-drone drone1 loc13 loc5)
   deleted: (at drone1 loc13)
   added: (at drone1 loc5)
   goals met: 2 of 16
11. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 3 of 16
12. (grab-arm1 drone1 crate8 depot)
   deleted: (arm1-free drone1) (at crate8 depot)
   added: (arm1-load drone1 crate8)
   goals met: 3 of 16
13. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 2 of 16
14. (deliver-arm1 drone1 person15 crate8 food loc4)
   deleted: (arm1-load drone1 crate8) (person-needs person15 food)
   added: (arm1-free drone1) (person-has person15 food)
   goals met: 3 of 16
15. (move-drone drone1 loc4 loc5)
   deleted: (at drone1 loc4)
   added: (at drone1 loc5)
   goals met: 3 of 16
16. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 4 of 16
17. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 4 of 16
18. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 3 of 16
19. (deliver-arm1 drone1 person5 crate7 food loc5)
   deleted: (arm1-load drone1 crate7) (person-needs person5 food)
   added: (arm1-free drone1) (person-has person5 food)
   goals met: 4 of 16
20. (deliver-arm2 drone1 person5 crate15 medicine loc5)
   deleted: (arm2-load drone1 crate15) (person-needs person5 medicine)
   added: (arm2-free drone1) (person-has person5 medicine)
   goals met: 5 of 16
21. (move-drone drone1 loc5 loc6)
   deleted: (at drone1 loc5)
   added: (at drone1 loc6)
   goals met: 5 of 16
22. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 6 of 16
23. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 6 of 16
24. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 6 of 16
25. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 5 of 16
26. (deliver-arm1 drone1 person1 crate6 food loc6)
   deleted: (arm1-load drone1 crate6) (person-needs person1 food)
   added: (arm1-free drone1) (person-has person1 food)
   goals met: 6 of 16
27. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 7 of 16
28. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 7 of 16
29. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 6 of 16
30. (deliver-arm2 drone1 person1 crate14 medicine loc6)
   deleted: (arm2-load drone1 crate14) (person-needs person1 medicine)
   added: (arm2-free drone1) (person-has person1 medicine)
   goals met: 7 of 16
31. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 8 of 16
32. (grab-arm2 drone1 crate13 depot)
   deleted: (arm2-free drone1) (at crate13 depot)
   added: (arm2-load drone1 crate13)
   goals met: 8 of 16
33. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 7 of 16
34. (deliver-arm1 drone1 person7 crate5 food loc6)
   deleted: (arm1-load drone1 crate5) (person-needs person7 food)
   added: (arm1-free drone1) (person-has person7 food)
   goals met: 8 of 16
35. (deliver-arm2 drone1 person7 crate13 medicine loc6)
   deleted: (arm2-load drone1 crate13) (person-needs person7 medicine)
   added: (arm2-free drone1) (person-has person7 medicine)
   goals met: 9 of 16
36. (move-drone drone1 loc6 loc8)
   deleted: (at drone1 loc6)
   added: (at drone1 loc8)
   goals met: 9 of 16
37. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 10 of 16
38. (grab-arm2 drone1 crate12 depot)
   deleted: (arm2-free drone1) (at crate12 depot)
   added: (arm2-load drone1 crate12)
   goals met: 10 of 16
39. (grab-arm1 drone1 crate4 depot)
   deleted: (arm1-free drone1) (at crate4 depot)
   added: (arm1-load drone1 crate4)
   goals met: 10 of 16
40. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 9 of 16
41. (deliver-arm1 drone1 person6 crate4 food loc8)
   deleted: (arm1-load drone1 crate4) (person-needs person6 food)
   added: (arm1-free drone1) (person-has person6 food)
   goals met: 10 of 16
42. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 11 of 16
43. (grab-arm1 drone1 crate3 depot)
   deleted: (arm1-free drone1) (at crate3 depot)
   added: (arm1-load drone1 crate3)
   goals met: 11 of 16
44. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 10 of 16
45. (deliver-arm2 drone1 person6 crate12 medicine loc8)
   deleted: (arm2-load drone1 crate12) (person-needs person6 medicine)
   added: (arm2-free drone1) (person-has person6 medicine)
   goals met: 11 of 16
46. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 12 of 16
47. (grab-arm2 drone1 crate11 depot)
   deleted: (arm2-free drone1) (at crate11 depot)
   added: (arm2-load drone1 crate11)
   goals met: 12 of 16
48. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 11 of 16
49. (deliver-arm2 drone1 person4 crate11 medicine loc12)
   deleted: (arm2-load drone1 crate11) (person-needs person4 medicine)
   added: (arm2-free drone1) (person-has person4 medicine)
   goals met: 12 of 16
50. (move-drone drone1 loc12 loc8)
   deleted: (at drone1 loc12)
   added: (at drone1 loc8)
   goals met: 12 of 16
51. (deliver-arm1 drone1 person10 crate3 food loc8)
   deleted: (arm1-load drone1 crate3) (person-needs person10 food)
   added: (arm1-free drone1) (person-has person10 food)
   goals met: 13 of 16
52. (move-drone drone1 loc8 loc12)
   deleted: (at drone1 loc8)
   added: (at drone1 loc12)
   goals met: 13 of 16
53. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 14 of 16
54. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 14 of 16
55. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 13 of 16
56. (deliver-arm2 drone1 person4 crate2 food loc12)
   deleted: (arm2-load drone1 crate2) (person-needs person4 food)
   added: (arm2-free drone1) (person-has person4 food)
   goals met: 14 of 16
57. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 15 of 16
58. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 15 of 16
59. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 14 of 16
60. (deliver-arm2 drone1 person12 crate1 food loc12)
   deleted: (arm2-load drone1 crate1) (person-needs person12 food)
   added: (arm2-free drone1) (person-has person12 food)
   goals met: 15 of 16
61. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 16 of 16
